## Pandas

+ 스프레드시트 및 관계형 데이터베이스와 같은 유연한 데이터 조작 기술
+ Matplotlib 라이브러리와 함꼐 데이터 분석

### Data Structures

### Series

+ 1차원 배열과 함께 사용
+ Series의 행 레이블 : 인덱스
+ list, tuple, dict는 Series 메소드로 변환 가능

In [3]:
import pandas as pd

# tuple -> Series
h = ('AA', '2020-02-02', 100, 10.2)
s = pd.Series(h) 
type(s)

pandas.core.series.Series

In [11]:
print(s) # tuple 변환에서 인덱스 : 숫자로 설정됨

0            AA
1    2020-02-02
2           100
3          10.2
dtype: object

In [7]:
f = ['FB', '2021-02-21', 90, 3.2]
f = pd.Series(f, index = ['name', 'date', 'shares', 'price']) # 사용자 지정 인덱스

print(f)

name              FB
date      2021-02-21
shares            90
price            3.2
dtype: object

In [8]:
f['shares'] # index 이름으로 접근

90

In [10]:
f[['shares', 'price']]

shares     90
price     3.2
dtype: object

In [9]:
f[0]

'FB'

In [5]:
# dict -> Series
d = {'name' : 'IBM', 'data' : '2020-02-22', 'shares' : 100, 'price' : 10.2}
ds = pd.Series(d)

type(ds)

pandas.core.series.Series

In [6]:
print(ds)

name             IBM
data      2020-02-22
shares           100
price           10.2
dtype: object

### DataFrame

+ 2차원 배열과 함께 사용
+ 행, 열 인덱스   
+ 행, 열 인덱스로 접근하면 1차원이 되므로 Series
+ 모든 스프레드 시트와 텍스트 파일은 DataFrame으로 읽힘

In [17]:
# list dict : DataFrame을 생성하는 가장 일반적인 방법
data = {
    'name' : ['AA', 'IBM', 'GOOG'],
    'date' : ['2010-12-01', '2012-02-10', '2020-04-09'],
    'shares' : [100, 30, 90],
    'price' : [12.3, 10.3, 32.2]
}
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [18]:
df

   name        date  shares  price
0    AA  2010-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2020-04-09      90   32.2

In [14]:
df['owner'] = 'Unknown' # 열 추가
df

   name        date  shares  price    owner
0    AA  2010-12-01     100   12.3  Unknown
1   IBM  2012-02-10      30   10.3  Unknown
2  GOOG  2020-04-09      90   32.2  Unknown

In [19]:
df.index = ['one', 'two', 'three'] # index 변경
df

       name        date  shares  price
one      AA  2010-12-01     100   12.3
two     IBM  2012-02-10      30   10.3
three  GOOG  2020-04-09      90   32.2

In [20]:
df = df.set_index(['name']) # DataFrame의 column을 set_index()를 사용하여 인덱스로 설정 -> 검생 성능 향상
df

            date  shares  price
name
AA    2010-12-01     100   12.3
IBM   2012-02-10      30   10.3
GOOG  2020-04-09      90   32.2

In [21]:
df['shares'] # column index로 접근

name
AA      100
IBM      30
GOOG     90
Name: shares, dtype: int64

In [24]:
df.loc['AA'] # row index로 접근

date      2010-12-01
shares           100
price           12.3
Name: AA, dtype: object

In [41]:
# loc 예제
ex_df = pd.DataFrame([[0,1,2],[3,4,5],[6,7,8]], index = ['r0', 'r1', 'r2'], columns = ['c0', 'c1','c2'])
ex_df

    c0  c1  c2
r0   0   1   2
r1   3   4   5
r2   6   7   8

In [42]:
ex_df.loc['r1']

c0    3
c1    4
c2    5
Name: r1, dtype: int64

In [43]:
ex_df.loc['r2','c1']

7

In [45]:
# ex_df.loc['c1'] 
# KeyError, loc는 label 기반으로 데이터 접근

In [46]:
ex_df.iloc[2,1]

7

In [49]:
df.drop('shares', axis = 1) # column 삭제
# del df['shares']

            date  price
name
AA    2010-12-01   12.3
IBM   2012-02-10   10.3
GOOG  2020-04-09   32.2

#### Reading files

In [4]:
import pandas as pd
casts = pd.read_csv("./ex_data/cast.csv", index_col = None) 
# casts = pd.read_csv("./ex_data/cast.csv", index_col = None, encoding='utf-8') 
# index_col = None : 인덱스 없음 (첫 번째 열 : data)

casts.head() # DataFrame의 처음 5개(default) 요소 출력
#casts.tail() # DataFrame의 마지막 5개(default) 요소 출력

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

#### DataFrame 조건식으로 데이터 필터링

In [66]:
after85 = casts[casts['year'] > 1985] 
after85.head()

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN

In [69]:
Movies90 = casts[(casts['year'] >= 1990) & (casts['year'] < 2000)]
Movies90.head()

,title,year,name,type,character,n
12,Mixing Nia,1998,Michael 'babeepower' Viera,actor,Rapper,NaN
19,Mariano Mison... NBI,1997,Joseph 'Byron' Sese,actor,Putik's Son,31.0
31,Pelotazo nacional,1993,F?lix 'El Gato',actor,Rebolledo,12.0
38,Killing Device,1993,Van 'Igor' Morrison,actor,Jeep Driver,51.0
44,Violencia urbana,1996,N?stor 'Kick Boxer',actor,Monta?a,21.0

#### Data Sorting

In [5]:
macbeth = casts[casts['title'] == 'Macbeth'] # 변수에 넣어주어야 함
# macbeth = casts[casts['title'] == 'Macbeth'].sort_index() # index 별로 정렬
macbeth.head()

         title  year                 name   type        character     n
12868  Macbeth  2015       Darren Adamson  actor          Soldier   NaN
22302  Macbeth  1916  Spottiswoode Aitken  actor           Duncan   4.0
25855  Macbeth  1948          Robert Alan  actor   Third Murderer   NaN
26990  Macbeth  2016        John Albasiny  actor           Doctor   NaN
38090  Macbeth  1948       William Alland  actor  Second Murderer  18.0

In [6]:
macbeth = casts[casts['title'] == 'Macbeth'].sort_values('year') # year 기준으로 정렬
macbeth.head()

         title  year                 name     type        character     n
22302  Macbeth  1916  Spottiswoode Aitken    actor           Duncan   4.0
63776  Macbeth  1916           Mary Alden  actress     Lady Macduff   6.0
25855  Macbeth  1948          Robert Alan    actor   Third Murderer   NaN
38090  Macbeth  1948       William Alland    actor  Second Murderer  18.0
40639  Macbeth  1997         Stevie Allen    actor         Murderer  21.0

#### Null values

파이썬 NaN : NA + NULL

In [74]:
macbeth.isnull().head() # null 값을 가질 경우 true
# macbeth.notnull().head() # null 값을 가지지 않을 경우 true

       title   year   name   type  character      n
22302  False  False  False  False      False  False
63776  False  False  False  False      False  False
25855  False  False  False  False      False   True
38090  False  False  False  False      False  False
40639  False  False  False  False      False  False

In [7]:
macbeth_fill = macbeth.fillna('NA') # NaN를 NA로 대체
macbeth_fill.head()

         title  year                 name     type        character     n
22302  Macbeth  1916  Spottiswoode Aitken    actor           Duncan   4.0
63776  Macbeth  1916           Mary Alden  actress     Lady Macduff   6.0
25855  Macbeth  1948          Robert Alan    actor   Third Murderer    NA
38090  Macbeth  1948       William Alland    actor  Second Murderer  18.0
40639  Macbeth  1997         Stevie Allen    actor         Murderer  21.0

In [8]:
macbeth_fill = macbeth.ffill() # NaN를 앞 필드의 값으로 대체
# macbeth_fill = macbeth.bfill() # NaN를 뒤 필드의 값으로 대체
macbeth_fill.head()

         title  year                 name     type        character     n
22302  Macbeth  1916  Spottiswoode Aitken    actor           Duncan   4.0
63776  Macbeth  1916           Mary Alden  actress     Lady Macduff   6.0
25855  Macbeth  1948          Robert Alan    actor   Third Murderer   6.0
38090  Macbeth  1948       William Alland    actor  Second Murderer  18.0
40639  Macbeth  1997         Stevie Allen    actor         Murderer  21.0

In [78]:
titles = casts['title']
titles.head()

0          Closet Monster
1         Suuri illusioni
2     Battle of the Sexes
3    Secret in Their Eyes
4              Steve Jobs
Name: title, dtype: object

In [79]:
casts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75001 entries, 0 to 75000
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      75001 non-null  object
 1   year       75001 non-null  int64
 2   name       75001 non-null  object
 3   type       75001 non-null  object
 4   character  75001 non-null  object
 5   n          46035 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 3.4+ MB

In [85]:
import numpy as np
df = pd.DataFrame(dict(age=[np.NaN, np.NaN,6],
                      born=[pd.NaT, pd.Timestamp('1930-05-25'), pd.Timestamp('1940-02-04')],
                      name=[np.NaN, 'Batman', ''],
                      toy=[None, 'Batmobile', 'Joker']))

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     1 non-null      float64
 1   born    2 non-null      datetime64[ns]
 2   name    2 non-null      object
 3   toy     2 non-null      object
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 224.0+ bytes

In [87]:
df

   age       born    name        toy
0  NaN        NaT     NaN       None
1  NaN 1930-05-25  Batman  Batmobile
2  6.0 1940-02-04              Joker

In [88]:
df.dropna(subset=['born']) # born column 중 NULL이 존재하는 데이터 삭제

   age       born    name        toy
1  NaN 1930-05-25  Batman  Batmobile
2  6.0 1940-02-04              Joker

In [20]:
casts['year'].value_counts().head() # 총 발생 횟수

2016    3841
2015    3439
2014    3309
2013    3110
2012    3011
Name: year, dtype: int64

#### String operations
.str. 옵션 사용

In [92]:
casts[casts['title'].str.startswith("Maa ")].head()
# Maa로 시작하는 데이터 검색

,title,year,name,type,character,n
21678,Maa on syntinen laulu,1973,Niiles-Jouni Aikio,actor,Oula,6.0
21680,Maa on syntinen laulu,1973,Uula Aikio,actor,Oulan is?,25.0
22986,Maa kap Phra,2006,Pisan Akaraseni,actor,Chief Yot,NaN
45518,Maa Nanna Chiranjeevi,2010,Alutit,actor,Vishwanath,NaN
59186,Maa on syntinen laulu,1973,Maija-Liisa Ahlgren,actress,Aino Liinukorpi,10.0

In [93]:
# padding ,, width = byte len

In [12]:
df = pd.DataFrame({'email':['     happy@gmail.com      ',
                            '       1004@NAVER.COM         ',
                            '      manse@yahoo.co.kr       ']})

In [13]:
df['email_strip']  = df['email'].str.strip()  # 앞 뒤 공백을 제거
df['email_lstrip'] = df['email'].str.lstrip() # 앞 공백을 제거
df['email_rstrip'] = df['email'].str.rstrip() # 뒤 공백을 제거

In [14]:
df

,email,email_strip,email_lstrip,email_rstrip
0,happy@gmail.com,happy@gmail.com,happy@gmail.com,happy@gmail.com
1,1004@NAVER.COM,1004@NAVER.COM,1004@NAVER.COM,1004@NAVER.COM
2,manse@yahoo.co.kr,manse@yahoo.co.kr,manse@yahoo.co.kr,manse@yahoo.co.kr

In [15]:
del df['email_strip']
del df['email_lstrip']
del df['email_rstrip']
df['email_pad']    = df['email'].str.pad(width=20, side='left', fillchar='_') # 지정길이 패딩
df['email_center'] = df['email'].str.center(width=20, fillchar='_') # 중앙놓고 지정길이 패딩
df['email_ljust']  = df['email'].str.ljust(width=20, fillchar='_')  # 왼쪽놓고 지정길이 패딩
df['email_rjust']  = df['email'].str.rjust(width=20, fillchar='_')  # 오른쪽놓고 지정길이 패딩
df['email_zfill']  = df['email'].str.zfill(width=20)                # 지정길이 0패딩

In [108]:
df

,email,email_pad,email_center,...,email_rfind,email_index,email_rindex
0,happy@gmail.com,_____happy@gmail.com,__happy@gmail.com___,...,11,11,11
1,1004@NAVER.COM,______1004@NAVER.COM,___1004@NAVER.COM___,...,10,10,10
2,manse@yahoo.co.kr,___manse@yahoo.co.kr,_manse@yahoo.co.kr__,...,14,11,14

In [16]:
del df['email_pad']
del df['email_center']
del df['email_ljust']
del df['email_rjust']
del df['email_zfill']
df['email_find']    = df['email'].str.find(sub='.')           # 왼쪽부터 sub값 검색후 위치반환
df['email_findall'] = df['email'].str.findall(pat='[a-zA-Z]') # 찾은 모든 값 반환
df['email_rfind']   = df['email'].str.rfind(sub='.')          # 오른쪽부터 sub값 검색후 위치반환
df['email_index']   = df['email'].str.index(sub='.')          # 왼쪽부터 sub값 검색후 위치반환
df['email_rindex']  = df['email'].str.rindex(sub='.')         # 오른쪽부터 sub값 검색후 위치반환

In [110]:
df

,email,email_find,email_findall,email_rfind,email_index,email_rindex
0,happy@gmail.com,11,"[h, a, p, p, y, g, m, a, i, l, c, o, m]",11,11,11
1,1004@NAVER.COM,10,"[N, A, V, E, R, C, O, M]",10,10,10
2,manse@yahoo.co.kr,11,"[m, a, n, s, e, y, a, h, o, o, c, o, k, r]",14,11,14

#### groupby

In [119]:
c = casts
cf = c[c['name'] == 'Aaron Abrams']
cf.groupby(['year']).size().head()
# 연도를 기준으로 'Aaron Abrams'의 영화 그룹화

year
2003    2
2004    2
2005    2
2006    1
2007    2
dtype: int64

In [120]:
cf.groupby(['year','title']).size().head() # groupby 연산 : year 수행된 뒤 title 수행

year  title
2003  The In-Laws                             1
      The Visual Bible: The Gospel of John    1
2004  Resident Evil: Apocalypse               1
      Siblings                                1
2005  Cinderella Man                          1
dtype: int64

In [121]:
c.groupby(['year']).n.max().head() # 연도별 최대 등급

year
1912     6.0
1913    14.0
1914    39.0
1915    14.0
1916    35.0
Name: n, dtype: float64

In [122]:
c.groupby(['year']).n.min().head() # 연도별 최소 등급

year
1912    6.0
1913    1.0
1914    1.0
1915    1.0
1916    1.0
Name: n, dtype: float64

In [123]:
c.groupby(['year']).n.mean().head() # 연도별 평균 등급

year
1912    6.000000
1913    4.142857
1914    7.085106
1915    4.236111
1916    5.037736
Name: n, dtype: float64

In [124]:
decade = c['year'] // 10 * 10 # 10년 단위
c_dec = c.groupby(decade).n.size().head() # 사용자 지정 groupby

In [125]:
c_dec

year
1910     669
1920    1121
1930    3448
1940    3997
1950    3892
Name: n, dtype: int64